# Estadistica Aplicada
## Edwin Javier Hernández Rodríguez 2034175
### Sesión 4

In [2]:
import numpy as np
import pandas as pd

In [4]:
# crear un diccionario
estadistica_g5 = {'Nombre': ['Juan', 'Pedro', 'Jose', 'Alejandra', 'Diana', 'Liz'], 
                  'Edad': [12,24,36,17,18,26]}

In [5]:
estadistica_g5

{'Nombre': ['Juan', 'Pedro', 'Jose', 'Alejandra', 'Diana', 'Liz'],
 'Edad': [12, 24, 36, 17, 18, 26]}

In [7]:
#convertir el diccionario en dataframe
estadistica_g5 = pd.DataFrame(estadistica_g5)

In [9]:
calificaciones = pd.read_csv('https://raw.githubusercontent.com/jimmyzac/Estadistica-Aplicada-FCFM-UANL/main/bases_datos/Calificaciones.csv')

In [15]:
calificaciones.tail()

    Id       Nombre   Apellido  Calficación Final
23  24         LUIS  DOMINGUEZ                 12
24  25      ALBERTO      ORTIZ                 99
25  26  JUAN CARLOS     IBAÑEZ                 43
26  27       ALVARO    RAMIREZ                 40
27  28       ADRIAN       SAEZ                  7

In [16]:
calificaciones.size

112

In [17]:
calificaciones.shape

(28, 4)

In [18]:
calificaciones.columns

Index(['Id', 'Nombre', 'Apellido', 'Calficación Final'], dtype='object')

In [19]:
calificaciones.index

RangeIndex(start=0, stop=28, step=1)

In [20]:
calificaciones.describe()

              Id  Calficación Final
count  28.000000          28.000000
mean   14.500000          52.000000
std     8.225975          34.113102
min     1.000000           1.000000
25%     7.750000          18.500000
50%    14.500000          48.500000
75%    21.250000          85.250000
max    28.000000         100.000000

In [22]:
calificaciones.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Id                 28 non-null     int64
 1   Nombre             28 non-null     object
 2   Apellido           28 non-null     object
 3   Calficación Final  28 non-null     int64
dtypes: int64(2), object(2)
memory usage: 1.0+ KB

In [23]:
calificaciones.head()

   Id   Nombre   Apellido  Calficación Final
0   1  ANTONIO     GARCIA                 73
1   2   MANUEL  FERNANDEZ                 19
2   3     JOSE   GONZALEZ                 38
3   4    DAVID      PEREZ                 14
4   5     JUAN      LOPEZ                 99

In [24]:
calificaciones['Situacion'] = np.where(calificaciones['Calficación Final']>=70, 'Aprobado', 'Reprobado')

In [25]:
calificaciones.head()

   Id   Nombre   Apellido  Calficación Final  Situacion
0   1  ANTONIO     GARCIA                 73   Aprobado
1   2   MANUEL  FERNANDEZ                 19  Reprobado
2   3     JOSE   GONZALEZ                 38  Reprobado
3   4    DAVID      PEREZ                 14  Reprobado
4   5     JUAN      LOPEZ                 99   Aprobado

In [27]:
calificaciones.rename(columns={'Calficación Final': 'cal_final'}, inplace = True)

In [28]:
calificaciones.head()

   Id   Nombre   Apellido  cal_final  Situacion
0   1  ANTONIO     GARCIA         73   Aprobado
1   2   MANUEL  FERNANDEZ         19  Reprobado
2   3     JOSE   GONZALEZ         38  Reprobado
3   4    DAVID      PEREZ         14  Reprobado
4   5     JUAN      LOPEZ         99   Aprobado

In [31]:
calificaciones = calificaciones.sort_values('cal_final', ascending = False)

In [32]:
calificaciones['cal_final'].mean()

52.0

In [34]:
calificaciones.groupby('Situacion').mean()['cal_final']

Situacion
Aprobado     90.100000
Reprobado    30.833333
Name: cal_final, dtype: float64

In [35]:
calificaciones.value_counts('Situacion')

Situacion
Reprobado    18
Aprobado     10
dtype: int64